business-listings-backend/app/controllers/api/v1/businesses_controller.rb

SELECT "businesses".* FROM "businesses"
---
    def index
        businesses = Business.all

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
      def show
        business = Business.find(params[:id])