business-listings-backend/app/controllers/api/v1/contacteds_controller.rb

SELECT "contacteds".* FROM "contacteds" WHERE "contacteds"."business_id" = ? AND "contacteds"."id" = ? LIMIT ?  [["business_id", 3], ["id", 3], ["LIMIT", 1]]
---
      def show
        contacted = @business.contacteds.find_by(id: params[:id])

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def set_business
        @business = Business.find(params[:business_id])